HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.RES_27 */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_RES_27_OFF (27u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.EIVLS */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_EIVLS_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.EIVLS */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_EIVLS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.EIVLS */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_EIVLS_OFF (28u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.EIVLRXS */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_EIVLRXS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.EIVLRXS */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_EIVLRXS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_CTRL_Bits.EIVLRXS */
#define IFX_GETH_MAC_VLAN_TAG_CTRL_EIVLRXS_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.VID */
#define IFX_GETH_MAC_VLAN_TAG_DATA_VID_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.VID */
#define IFX_GETH_MAC_VLAN_TAG_DATA_VID_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.VID */
#define IFX_GETH_MAC_VLAN_TAG_DATA_VID_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.VEN */
#define IFX_GETH_MAC_VLAN_TAG_DATA_VEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.VEN */
#define IFX_GETH_MAC_VLAN_TAG_DATA_VEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.VEN */
#define IFX_GETH_MAC_VLAN_TAG_DATA_VEN_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.ETV */
#define IFX_GETH_MAC_VLAN_TAG_DATA_ETV_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.ETV */
#define IFX_GETH_MAC_VLAN_TAG_DATA_ETV_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.ETV */
#define IFX_GETH_MAC_VLAN_TAG_DATA_ETV_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.DOVLTC */
#define IFX_GETH_MAC_VLAN_TAG_DATA_DOVLTC_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.DOVLTC */
#define IFX_GETH_MAC_VLAN_TAG_DATA_DOVLTC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.DOVLTC */
#define IFX_GETH_MAC_VLAN_TAG_DATA_DOVLTC_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.ERSVLM */
#define IFX_GETH_MAC_VLAN_TAG_DATA_ERSVLM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.ERSVLM */
#define IFX_GETH_MAC_VLAN_TAG_DATA_ERSVLM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.ERSVLM */
#define IFX_GETH_MAC_VLAN_TAG_DATA_ERSVLM_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.ERIVLT */
#define IFX_GETH_MAC_VLAN_TAG_DATA_ERIVLT_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.ERIVLT */
#define IFX_GETH_MAC_VLAN_TAG_DATA_ERIVLT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.ERIVLT */
#define IFX_GETH_MAC_VLAN_TAG_DATA_ERIVLT_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.DMACHEN */
#define IFX_GETH_MAC_VLAN_TAG_DATA_DMACHEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.DMACHEN */
#define IFX_GETH_MAC_VLAN_TAG_DATA_DMACHEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.DMACHEN */
#define IFX_GETH_MAC_VLAN_TAG_DATA_DMACHEN_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.DMACHN */
#define IFX_GETH_MAC_VLAN_TAG_DATA_DMACHN_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.DMACHN */
#define IFX_GETH_MAC_VLAN_TAG_DATA_DMACHN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_DATA_Bits.DMACHN */
#define IFX_GETH_MAC_VLAN_TAG_DATA_DMACHN_OFF (25u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.VID */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_VID_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.VID */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_VID_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.VID */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_VID_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.VEN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_VEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.VEN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_VEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.VEN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_VEN_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ETV */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ETV_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ETV */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ETV_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ETV */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ETV_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DOVLTC */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DOVLTC_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DOVLTC */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DOVLTC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DOVLTC */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DOVLTC_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERSVLM */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERSVLM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERSVLM */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERSVLM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERSVLM */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERSVLM_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERIVLT */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERIVLT_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERIVLT */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERIVLT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERIVLT */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERIVLT_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DMACHEN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DMACHEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DMACHEN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DMACHEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DMACHEN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DMACHEN_OFF (24u)

