HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.FCB_BPA */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_FCB_BPA_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.TFE */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_TFE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.TFE */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_TFE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.TFE */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_TFE_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PLT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PLT_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PLT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PLT_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PLT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PLT_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.DZPQ */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_DZPQ_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.DZPQ */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_DZPQ_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.DZPQ */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_DZPQ_OFF (7u)

/** \brief Length for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PT_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_Q0_TX_FLOW_CTRL_Bits.PT */
#define IFX_GETH_MAC_Q0_TX_FLOW_CTRL_PT_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.RFE */
#define IFX_GETH_MAC_RX_FLOW_CTRL_RFE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.RFE */
#define IFX_GETH_MAC_RX_FLOW_CTRL_RFE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.RFE */
#define IFX_GETH_MAC_RX_FLOW_CTRL_RFE_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.UP */
#define IFX_GETH_MAC_RX_FLOW_CTRL_UP_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.UP */
#define IFX_GETH_MAC_RX_FLOW_CTRL_UP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RX_FLOW_CTRL_Bits.UP */
#define IFX_GETH_MAC_RX_FLOW_CTRL_UP_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQE_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQ_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQ_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.UFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_UFFQ_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQE_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQ_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQ_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.MFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_MFFQ_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQE */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQE_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQ_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQ_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL4_Bits.VFFQ */
#define IFX_GETH_MAC_RXQ_CTRL4_VFFQ_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ0EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ0EN_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ0EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ0EN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ0EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ0EN_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ1EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ1EN_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ1EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ1EN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ1EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ1EN_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ2EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ2EN_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ2EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ2EN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ2EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ2EN_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ3EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ3EN_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ3EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ3EN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL0_Bits.RXQ3EN */
#define IFX_GETH_MAC_RXQ_CTRL0_RXQ3EN_OFF (6u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL1_Bits.AVCPQ */
#define IFX_GETH_MAC_RXQ_CTRL1_AVCPQ_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL1_Bits.AVCPQ */
#define IFX_GETH_MAC_RXQ_CTRL1_AVCPQ_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL1_Bits.AVCPQ */
#define IFX_GETH_MAC_RXQ_CTRL1_AVCPQ_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL1_Bits.PTPQ */
#define IFX_GETH_MAC_RXQ_CTRL1_PTPQ_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL1_Bits.PTPQ */
#define IFX_GETH_MAC_RXQ_CTRL1_PTPQ_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MAC_RXQ_CTRL1_Bits.PTPQ */
#define IFX_GETH_MAC_RXQ_CTRL1_PTPQ_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_RXQ_CTRL1_Bits.UPQ */
#define IFX_GETH_MAC_RXQ_CTRL1_UPQ_LEN (3u)

/** \brief Mask for Ifx_GETH_MAC_RXQ_CTRL1_Bits.UPQ */
#define IFX_GETH_MAC_RXQ_CTRL1_UPQ_MSK (0x7u)

