HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSPEED */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSPEED_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSPEED */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSPEED_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSTS */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSTS */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_PHYIF_CONTROL_STATUS_Bits.LNKSTS */
#define IFX_GETH_MAC_PHYIF_CONTROL_STATUS_LNKSTS_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_VERSION_Bits.SNPSVER */
#define IFX_GETH_MAC_VERSION_SNPSVER_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_VERSION_Bits.SNPSVER */
#define IFX_GETH_MAC_VERSION_SNPSVER_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_VERSION_Bits.SNPSVER */
#define IFX_GETH_MAC_VERSION_SNPSVER_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_VERSION_Bits.USERVER */
#define IFX_GETH_MAC_VERSION_USERVER_LEN (8u)

/** \brief Mask for Ifx_GETH_MAC_VERSION_Bits.USERVER */
#define IFX_GETH_MAC_VERSION_USERVER_MSK (0xffu)

/** \brief Offset for Ifx_GETH_MAC_VERSION_Bits.USERVER */
#define IFX_GETH_MAC_VERSION_USERVER_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_DEBUG_Bits.RPESTS */
#define IFX_GETH_MAC_DEBUG_RPESTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_DEBUG_Bits.RPESTS */
#define IFX_GETH_MAC_DEBUG_RPESTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_DEBUG_Bits.RPESTS */
#define IFX_GETH_MAC_DEBUG_RPESTS_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_DEBUG_Bits.RFCFCSTS */
#define IFX_GETH_MAC_DEBUG_RFCFCSTS_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_DEBUG_Bits.RFCFCSTS */
#define IFX_GETH_MAC_DEBUG_RFCFCSTS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_DEBUG_Bits.RFCFCSTS */
#define IFX_GETH_MAC_DEBUG_RFCFCSTS_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_DEBUG_Bits.TPESTS */
#define IFX_GETH_MAC_DEBUG_TPESTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_DEBUG_Bits.TPESTS */
#define IFX_GETH_MAC_DEBUG_TPESTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_DEBUG_Bits.TPESTS */
#define IFX_GETH_MAC_DEBUG_TPESTS_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_DEBUG_Bits.TFCSTS */
#define IFX_GETH_MAC_DEBUG_TFCSTS_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_DEBUG_Bits.TFCSTS */
#define IFX_GETH_MAC_DEBUG_TFCSTS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_DEBUG_Bits.TFCSTS */
#define IFX_GETH_MAC_DEBUG_TFCSTS_OFF (17u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.MIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_MIISEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.MIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_MIISEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.MIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_MIISEL_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.GMIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_GMIISEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.GMIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_GMIISEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.GMIISEL */
#define IFX_GETH_MAC_HW_FEATURE0_GMIISEL_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.HDSEL */
#define IFX_GETH_MAC_HW_FEATURE0_HDSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.HDSEL */
#define IFX_GETH_MAC_HW_FEATURE0_HDSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.HDSEL */
#define IFX_GETH_MAC_HW_FEATURE0_HDSEL_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.PCSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_PCSSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.PCSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_PCSSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.PCSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_PCSSEL_OFF (3u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.VLHASH */
#define IFX_GETH_MAC_HW_FEATURE0_VLHASH_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.VLHASH */
#define IFX_GETH_MAC_HW_FEATURE0_VLHASH_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.VLHASH */
#define IFX_GETH_MAC_HW_FEATURE0_VLHASH_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.SMASEL */
#define IFX_GETH_MAC_HW_FEATURE0_SMASEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.SMASEL */
#define IFX_GETH_MAC_HW_FEATURE0_SMASEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.SMASEL */
#define IFX_GETH_MAC_HW_FEATURE0_SMASEL_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.RWKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_RWKSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.RWKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_RWKSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.RWKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_RWKSEL_OFF (6u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.MGKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MGKSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.MGKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MGKSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.MGKSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MGKSEL_OFF (7u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.MMCSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MMCSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.MMCSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MMCSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.MMCSEL */
#define IFX_GETH_MAC_HW_FEATURE0_MMCSEL_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.ARPOFFSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ARPOFFSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.ARPOFFSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ARPOFFSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.ARPOFFSEL */
#define IFX_GETH_MAC_HW_FEATURE0_ARPOFFSEL_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.TSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_TSSEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.TSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_TSSEL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_HW_FEATURE0_Bits.TSSEL */
#define IFX_GETH_MAC_HW_FEATURE0_TSSEL_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_HW_FEATURE0_Bits.EEESEL */
#define IFX_GETH_MAC_HW_FEATURE0_EEESEL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_HW_FEATURE0_Bits.EEESEL */
#define IFX_GETH_MAC_HW_FEATURE0_EEESEL_MSK (0x1u)

