HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXRCVERRPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXRCVERRPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXRCVERRPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXRCVERRPIS_OFF (24u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXCTRLPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXCTRLPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXCTRLPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXCTRLPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXCTRLPIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXCTRLPIS_OFF (25u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPIUSCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPIUSCIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPIUSCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPIUSCIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPIUSCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPIUSCIS_OFF (26u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPITRCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPITRCIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPITRCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPITRCIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_Bits.RXLPITRCIS */
#define IFX_GETH_MMC_RX_INTERRUPT_RXLPITRCIS_OFF (27u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBOCTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBOCTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBOCTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBOCTIS_OFF (0u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBPKTIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBPKTIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXGBPKTIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXGBPKTIS_OFF (1u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGPIS_OFF (2u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGPIS_OFF (3u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX64OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX64OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX64OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX64OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX64OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX64OCTGBPIS_OFF (4u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX65T127OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX65T127OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX65T127OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_OFF (5u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX128T255OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX128T255OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX128T255OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_OFF (6u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX256T511OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX256T511OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX256T511OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_OFF (7u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX512T1023OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX512T1023OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX512T1023OCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_OFF (8u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TX1024TMAXOCTGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_OFF (9u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUCGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUCGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUCGBPIS_OFF (10u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCGBPIS_OFF (11u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGBPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGBPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXBCGBPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXBCGBPIS_OFF (12u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUFLOWERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUFLOWERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUFLOWERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUFLOWERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXUFLOWERPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXUFLOWERPIS_OFF (13u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXSCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXSCOLGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXSCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXSCOLGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXSCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXSCOLGPIS_OFF (14u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_Bits.TXMCOLGPIS */
#define IFX_GETH_MMC_TX_INTERRUPT_TXMCOLGPIS_LEN (1u)

