HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXMCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXMCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXMCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXMCGPIM_OFF (4u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXCRCERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXCRCERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXCRCERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_OFF (5u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXALGNERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXALGNERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXALGNERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_OFF (6u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXRUNTPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXRUNTPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXRUNTPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_OFF (7u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXJABERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXJABERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXJABERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXJABERPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXJABERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXJABERPIM_OFF (8u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXUSIZEGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXUSIZEGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXUSIZEGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXUSIZEGPIM_OFF (9u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXOSIZEGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXOSIZEGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXOSIZEGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXOSIZEGPIM_OFF (10u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX64OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX64OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX64OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX64OCTGBPIM_OFF (11u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX65T127OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX65T127OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX65T127OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX65T127OCTGBPIM_OFF (12u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX128T255OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX128T255OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX128T255OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX128T255OCTGBPIM_OFF (13u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX256T511OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX256T511OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX256T511OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX256T511OCTGBPIM_OFF (14u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX512T1023OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX512T1023OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX512T1023OCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX512T1023OCTGBPIM_OFF (15u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX1024TMAXOCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX1024TMAXOCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RX1024TMAXOCTGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RX1024TMAXOCTGBPIM_OFF (16u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXUCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXUCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXUCGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXUCGPIM_OFF (17u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXLENERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXLENERPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXLENERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXLENERPIM_MSK (0x1u)

