HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXLENERPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXLENERPIM_OFF (18u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXORANGEPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXORANGEPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXORANGEPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXORANGEPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXORANGEPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXORANGEPIM_OFF (19u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXPAUSPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXPAUSPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXPAUSPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXPAUSPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXPAUSPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXPAUSPIM_OFF (20u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXFOVPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXFOVPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXFOVPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXFOVPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXFOVPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXFOVPIM_OFF (21u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXVLANGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXVLANGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXVLANGBPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXVLANGBPIM_OFF (22u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXWDOGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXWDOGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXWDOGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXWDOGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXWDOGPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXWDOGPIM_OFF (23u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXRCVERRPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXRCVERRPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXRCVERRPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXRCVERRPIM_OFF (24u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXCTRLPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXCTRLPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXCTRLPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXCTRLPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXCTRLPIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXCTRLPIM_OFF (25u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXLPIUSCIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXLPIUSCIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXLPIUSCIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM_OFF (26u)

/** \brief Length for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXLPITRCIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXLPITRCIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_RX_INTERRUPT_MASK_Bits.RXLPITRCIM */
#define IFX_GETH_MMC_RX_INTERRUPT_MASK_RXLPITRCIM_OFF (27u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGBOCTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGBOCTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGBOCTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGBOCTIM_OFF (0u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGBPKTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGBPKTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXGBPKTIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXGBPKTIM_OFF (1u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXBCGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXBCGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXBCGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXBCGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXBCGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXBCGPIM_OFF (2u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXMCGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXMCGPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXMCGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXMCGPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TXMCGPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TXMCGPIM_OFF (3u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX64OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX64OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX64OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX64OCTGBPIM_OFF (4u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX65T127OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX65T127OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX65T127OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX65T127OCTGBPIM_OFF (5u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX128T255OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX128T255OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX128T255OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX128T255OCTGBPIM_OFF (6u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX256T511OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX256T511OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX256T511OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX256T511OCTGBPIM_OFF (7u)

/** \brief Length for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX512T1023OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_TX_INTERRUPT_MASK_Bits.TX512T1023OCTGBPIM */
#define IFX_GETH_MMC_TX_INTERRUPT_MASK_TX512T1023OCTGBPIM_MSK (0x1u)

