HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxGeth_bf.h
/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6NOPAYOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6NOPAYOIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6NOPAYOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6NOPAYOIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXIPV6NOPAYOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXIPV6NOPAYOIM_OFF (23u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPGOIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPGOIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPGOIM_OFF (24u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPEROIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPEROIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXUDPEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXUDPEROIM_OFF (25u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPGOIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPGOIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPGOIM_OFF (26u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPEROIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPEROIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXTCPEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXTCPEROIM_OFF (27u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPGOIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPGOIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPGOIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPGOIM_OFF (28u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPEROIM_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPEROIM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_MASK_Bits.RXICMPEROIM */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_MASK_RXICMPEROIM_OFF (29u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4GPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4GPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4GPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4GPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4GPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4GPIS_OFF (0u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4HERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4HERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4HERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4HERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4HERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4HERPIS_OFF (1u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4NOPAYPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4NOPAYPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4NOPAYPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4NOPAYPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4NOPAYPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4NOPAYPIS_OFF (2u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4FRAGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4FRAGPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4FRAGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4FRAGPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4FRAGPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4FRAGPIS_OFF (3u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4UDSBLPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4UDSBLPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4UDSBLPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4UDSBLPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV4UDSBLPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV4UDSBLPIS_OFF (4u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6GPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6GPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6GPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6GPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6GPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6GPIS_OFF (5u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6HERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6HERPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6HERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6HERPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6HERPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6HERPIS_OFF (6u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6NOPAYPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6NOPAYPIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6NOPAYPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6NOPAYPIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXIPV6NOPAYPIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXIPV6NOPAYPIS_OFF (7u)

