HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RIE_OFF (6u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RBUE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RBUE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RBUE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RBUE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RBUE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RBUE_OFF (7u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RSE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RSE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RSE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RSE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RSE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RSE_OFF (8u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RWTE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RWTE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RWTE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RWTE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.RWTE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_RWTE_OFF (9u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.ETIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_ETIE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.ETIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_ETIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.ETIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_ETIE_OFF (10u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.ERIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_ERIE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.ERIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_ERIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.ERIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_ERIE_OFF (11u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.FBEE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_FBEE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.FBEE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_FBEE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.FBEE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_FBEE_OFF (12u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.CDEE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_CDEE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.CDEE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_CDEE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.CDEE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_CDEE_OFF (13u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.AIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_AIE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.AIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_AIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.AIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_AIE_OFF (14u)

/** \brief Length for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.NIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_NIE_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.NIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_NIE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_INTERRUPT_ENABLE_Bits.NIE */
#define IFX_GETH_DMA_CH_INTERRUPT_ENABLE_NIE_OFF (15u)

/** \brief Length for Ifx_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_Bits.RWT */
#define IFX_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWT_LEN (8u)

/** \brief Mask for Ifx_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_Bits.RWT */
#define IFX_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWT_MSK (0xffu)

/** \brief Offset for Ifx_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_Bits.RWT */
#define IFX_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWT_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_Bits.RWTU */
#define IFX_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_LEN (2u)

/** \brief Mask for Ifx_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_Bits.RWTU */
#define IFX_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_MSK (0x3u)

/** \brief Offset for Ifx_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_Bits.RWTU */
#define IFX_GETH_DMA_CH_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_OFF (16u)

/** \brief Length for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.ESC */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_ESC_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.ESC */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_ESC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.ESC */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_ESC_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.ASC */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_ASC_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.ASC */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_ASC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.ASC */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_ASC_OFF (1u)

/** \brief Length for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.SIV */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_SIV_LEN (12u)

/** \brief Mask for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.SIV */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_SIV_MSK (0xfffu)

/** \brief Offset for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.SIV */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_SIV_OFF (4u)

/** \brief Length for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.RSN */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_RSN_LEN (4u)

/** \brief Mask for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.RSN */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_RSN_MSK (0xfu)

/** \brief Offset for Ifx_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_Bits.RSN */
#define IFX_GETH_DMA_CH_SLOT_FUNCTION_CONTROL_STATUS_RSN_OFF (16u)

/** \brief Length for Ifx_GETH_DMA_CH_CURRENT_APP_TXDESC_Bits.CURTDESAPTR */
#define IFX_GETH_DMA_CH_CURRENT_APP_TXDESC_CURTDESAPTR_LEN (32u)

